export const metadata = {
  title: "无题",
  tags: [], // e.g., ["Tech/Reinforcement Learning"] or ["Life/Philosophy"]
  summary: "很小的时候我曾站在站在窗台边远眺家门口车水马龙的长寿路。那时候曾梦想过顺着这条路远远地走，走到我不认识的地方。",
  hidden: false // This post won't show up in the blog list
};

export const content = `
我家住19楼。从父母卧室的窗户往下看，可以看到一条日夜车流穿梭不停的大马路，弯弯地蔓延向远方，最后被高高的购物商场遮挡住。

很小的时候，做数学题被要求罚站之际，我曾无数次泪眼婆娑地看向这条马路，视线随着这路延伸，梦想着有一天我可以不被家人管束，或步行，或坐计程车，顺这路往前走，走的越远越好。
几年之后，我已经去过很远的地方，现在呆在这里，已经不想再出去。

许多我同龄人的博客里都爱写他们多么爱自由，多么想要脱离束缚，能够张开翅膀在远方奋斗是多么幸福多么觉得有趣；对他们来说，人生的苦难就是用来攻克的，他们好像有无限的力量，这种无限的力量我也曾有，怎么现在没有了，我也说不清楚。

很小的时候我就知道我会和父母去一个遥远的地方。当时我觉得万般新奇，可同时也是傻气横生。小时候的我还只是在纠结与想要交朋友想要被人喜欢的阶段，当然无法理解当我理所当然地告诉我的同学们我要去国外读书的时候，他们是怎么想的。
那个时候我心很好。我认真读书，但是成绩只是中上。我认为学校里的老师虽然严厉但一定都是为我好的，以至于当时那初中班主任把我喊起来，我流着汗背不住课文时阴阳怪气的斥责也依旧没有让我感觉到有什么异样。初中毕业的那年我回国看同学们，她露出欣慰的表情，见到我后说的第一句话却是：“虽然你已经去过了国外，却始终没有忘记我们这个集体”。我呆住了，心中想到，难道对她来说，我存在的意义也只是这集体颗零件吗？

我还是太单纯了，但心里已经种下了一种奇怪的憎恨，而现在这种憎恨我已经明白，并且很不幸地已经贯穿我的性格和我的心绪，成为了我的一部分。

那时候我的确就是没有朋友。我的性格外向，开智晚，只是一位地想要对别人好，但不懂得社交的潜规则。于是我不理解，开始有脾气，我开始觉得不公平。除此之外，我还有不少奇怪的点。那时候就在想，为什么是我这么奇怪？为什么不是别人？为什么我要承受这些？等懂事之后，我的愤怒便变得更佳复杂。这世上明明有不少人生活在水生火热之中，只是为了一份基础的工作疲于奔命，而我坐在空调房里，舒舒服服地准备去一个不错的公司上班，却还在抱怨这种莫名其妙的小事。但是心里的酸楚我无法去说谎。

可是我无比想念我的家乡。我憎恨每一个地方。为什么洛杉矶这么乱？为什么我走在家门口都差点被抢劫？为什么贫富差距这么大？为什么这地方的社会这么乱，仿佛是个人吃人的蛮荒之地？为什么有些人蠢得理直气壮？为什么有些人生来就比我受过更好的教育，生来就比我有更开阔的胸襟，生来就有人教导他们如何去待人接物，如何去对自己拥有自信，如何成为一个快乐自洽的人？反之，为什么我深爱的这座不夜城如此残酷，如此潮湿，如此竞争激烈而让这里的人饱受痛苦？而现在，为了生存，我都无法真正地回来。

这个地方是我的家。我喜欢大城市的喧嚣，加州乡村的房子和到了晚上八点钟就空空荡荡的马路令我感到无限寂寞。这是我最熟悉的地方，我长大的地方。我知道父亲想让我回来，我也想陪爷爷奶奶走过最后一程，但是我无法做到。我知道在那个鸟不拉屎的地方我会有一个更佳光明的未来。所以我对一切都感到烦躁。我被这种犹豫不决和背离家乡的悲伤一直折磨着。这是我个人的地狱。

朋友的个人博客里满满都是聊些什么他们每天都学过的东西，每天都在做的思考，每天做的研究，可是我累了。我不想再假装自己的志向他们一样。我想当个画画的，写散文的，写小说的。我并不想这辈子研究算法研究数学研究什么别的东西。我会好奇，但我已经累了，我不想再骗自己我想当什么学术界了不起的人才了。我其实也不想当老师。我只是想有一件自己的小屋子，呆在里面和木质模型和绘材讲话，甚至不想和那些什么所谓艺术学院里出来的画师相比。我也不想做什么了不得的faang engineer,我真的装够了。很累，无法允许自己去做想做的事情很累，现在已经对想做的事情也心灰意冷很累，每天想着这世上这么多人还在为温饱受苦我却在这里痛苦这个很累。好像这世上没有什么能让我真正快乐的。反正，有这种感觉已经很久了。

还有五天我就要离开了，再说什么也无济于事。
`; 